import Authenticated from "@/Layouts/Authenticated";
import { Head } from "@inertiajs/inertia-react";
import { useState } from "react";
import { motion } from "framer-motion";
import { SlideDown } from "@/animations";
import { FiSun } from "react-icons/fi";
import {MdOutlineNightlight} from "react-icons/md";

export default function Stages() {
    
    const stage1 = [
        [
            "أن يكون الطالب حاصلاً على شهادة الدراسة الإعدادية العراقية، أو الشهادة المعادلة لها معززة بتصديق من المديرية العامة للتربية في المحافظة، وعلى وفق مدخلات القبول الخاصة بكل تخصص ."
        ],
        [
            "أن يكون من مواليد سنة 1992 صعوداً."
        ],
        [
            "يتنافس الطلبة خريجو العام الدراسي (2021-2022) للقبول في جامعة العميد وجامعة وارث الانبياء / كلية الطب العام والحاصلين على معدل (90% فما فوق) ، اضافة الى خريجي العام الدراسي السابق (2021/2020) والحاصلين على معدل (95%) فما فوق) وبنسبة (10%) من خطة القبول للجامعة / الكلية اعلاه شرط عدم التحاقهم بكليات المجموعة الطبية طب الاسنان الصيدلة ضمن التعليم الحكومي العام والخاص والتعليم الأهلي."
        ],
        [
            "يحق لخريجي المراكز المهنية مركز المعتصم ومركز الوليد ومركز المعتز) والمراكز المهنية التي مدة الدراسة فيها ثلاث سنوات وأدوا الامتحان الوزاري (البكلوريا) حصراً التقديم في الجامعات والكليات الأهلية وعلى وفق المدخلات الخاصة بكل تخصص."
        ],
        [
            "ان يكون الطالب متفرغاً للدراسة ولا يجوز الجمع بين الوظيفة والدراسة (في الوقت ذاته في الجامعات والكليات الصباحية ويشمل ذلك منتسبي المؤسسات الحكومية كافة ويشترط في استمرارهم بالدراسة الحصول على إجازة دراسية من دوائرهم ابتداء على وفق التعليمات النافذة، ولا يجوز الجمع بين دراستين أيضاً وفي حال ثبوت خلاف ذلك يكتب إلى الوزارة / دائرة التعليم الجامعي الاهلي لإلغاء قبول الطالب."
        ],
        [
            "ان يجتاز الطالب الفحص الطبي على وفق الشروط الخاصة بكل دراسة ويحق للطالب المكفوف الذي تتوفر فيه الشروط التقديم للدراسات الإنسانية الملائمة.",
        ],
        [
            "يحق للطالب المقبول في احدى الجامعات الكليات الاهلية للسنوات السابقة التقديم إلى قسم آخر في نفس الكلية على وفق مدخلات وشروط التقديم للعام (2023/2022) وفي حال قبوله تصدر جامعته كليته امراً ادارياً بتغيير قسمه وترقين قيده في القسم السابق ويباشر في المرحلة الأولى لقبوله الجديد ويتم اعلام الوزارة بذلك."
        ],
        [
            "يرقن قيد الطالب في حال قبوله في جامعة / كلية اخرى او الدراسة خارج العراق أو حصوله على تعيين بعد تقديم طلب تحريري بذلك من قبل الطالب خلال مدة اسبوع عمل من تاريخ تقديم الطلب.",
        ],
        [
            "يحق للطالب المقبول في الجامعات والكليات الحكومية التقديم للقبول في الجامعات والكليات الاهلية على وفق الاستمارة الالكترونية ومبدأ المفاضلة وعلى وفق مدخلات وشروط التقديم للعام (2023/2022) ويكون تسليم ملف الطالب بموجب محضر تسليم وتسلم عن طريق المخولين بذلك وخلال مدة لا تتجاوز (60) يوماً من تاريخ اصدار امر القبول وبخلافه تتحمل الجامعة الكلية تبعات ذلك."
        ],
        [
            "يحق للطالب الذي تم ترقين قيده في احدى الجامعات الكليات الاهلية التقديم مجدداً على وفق الاستمارة الالكترونية ومبدأ المفاضلة وعلى وفق مدخلات وشروط التقديم للعام (2023/2022) على أن لا يقوم الطالب بالتقديم للقبول في القسم ذاته الذي تم ترقين قيده فيه.",
        ],
        [
            "لا يسمح للجامعات الكليات الاهلية بتسلم أي مبلغ من الاجور الدراسية او ما يسمى بالتأمينات او استحصال أي مبالغ أخرى من الطالب قبل ظهور قبول الطالب وتسجيله في الجامعة / الكلية الأهلية كما لا يسمح للجامعات الكليات الاهلية القيام بتخصيص مقاعد او قبولات مبدئية او ما يسمى بحجز المقاعد خارج منظومة القبول الالكتروني ."
        ],
        [
            "لا يحق للوزراء ومن هم بدرجتهم واعضاء مجلس النواب وذوي الدرجات الخاصة واعضاء مجالس المحافظات التقديم للقبول في الدراسة الصباحية."
        ],
        [
            "بإمكان طلبة اقليم كردستان من خريجي الدراسة الاعدادية المعترف بها من قبل وزارة التربية التقديم للقبول في الجامعات والكليات الاهلية."
        ],
        [
            "بعد قبول الطلبة يتم اصدار الأوامر الوزارية من دائرة التعليم الجامعي الاهلي ويتم على اساسها اصدار الأوامر الجامعية للجامعات والأوامر الادارية للكليات يتضمن اسماء الطلبة المقبولين ويتم عرضها على مجلس الكلية لتصديقها."
        ],
        [
            "يتم تدقيق بيانات الطلبة المقبولين في الجامعات والكليات الاهلية للعام الدراسي 2023/2022 مع دائرة التعليم الجامعي الاهلي ووفق السياقات التي تحددها الدائرة."
        ],
    ];
    const stage2 = [
        [
            "أن يكون الطالب حاصلاً على شهادة الدراسة الإعدادية العراقية أو الشهادة المعادلة لها معززة بتصديق من المديرية العامة للتربية في المحافظة."
        ],
        [
            "ان لا يكون الطالب مقبولاً في دراسة أخرى إذ لا يجوز الجمع بين الدراستين وفي حال ثبوت ذلك يتحمل الطالب التبعات القانونية ومنها الغاء قبوله."
        ],
        [
            "ان يكون الطالب ناجحا في الفحص الطبي على وفق الشروط الخاصة بكل دراسة ويحق للطالب المكفوف الذي تتوفر فيه الشروط التقديم للدراسات الإنسانية الملائمة."
        ],
        [
            "تخول مجالس الجامعات والكليات الاهلية صلاحية تحويل دراسة الطالب من الدراسة الصباحية إلى الدراسة المسائية للمراحل الدراسية كافة مع الغاء شرط التعيين مع ضرورة الالتزام بالطاقة الاستيعابية عند تحويل دراسة الطالب على ان لا يكون الطالب من المتخرجين للأعوام السابقة وتتحمل الجامعات والكليات الاهلية مسؤولية صحة المعلومات المقدمة من قبل الطالب لغرض التحويل مع اعلام دائرة التعليم الجامعي الاهلي لغرض تأشيره في قاعدة بيانات الطلبة."
        ],
        [
            "يكون بدء الدوام الرسمي في الساعة 2:00 ب.ض. الى 7:00 مساءً."
        ]
    ];
    const [stageState, setStageState] = useState(0);
    const stg1 = () => {
        if(stageState == 0 || stageState == 2){
            setStageState(1);
        }else{
            setStageState(0);
        }
    };
    const stg2 = () => {
        if(stageState == 0 || stageState == 1){
            setStageState(2);
        }else{
            setStageState(0);
        }
    };
    return (
        <Authenticated >
            <Head title="شروط واسس التقديم" />

            <div className="py-12">
                <div className="max-w-7xl text-center mx-auto sm:px-6 lg:px-8">
                    <div className="bg-white overflow-hidden shadow-xl sm:rounded-lg p-16">
                        {/* at click on id stage1 change stageState  */}
                        <div className="flex gap-x-2 justify-center items-center mb-2" onClick={() => stg1()}>
                            <div id="stage1" className="text-2xl font-bold cursor-pointer">شروط وأسس التقديم للدراسة الصباحية</div>
                            <FiSun className="h-10 w-10 items-center text-yellow-400" />
                        </div>
                        {stageState === 1 && (
                            <>
                                <div className="w-1/3 h-1 bg-gray-700 rounded-md mx-auto mb-7"></div>
                                <motion.ol variants={SlideDown} initial="hidden" animate="show" dir="rtl" className="text-right text-lg leading-10 list-decimal list-outside space-y-3">
                                    {stage1.map((item, index) => (
                                        <li className="text-justify" key={index}>{item}</li>
                                    ))}
                                </motion.ol>
                            </>
                        )}
                    </div>
                </div>
            </div>
            <div className="py-4">
                <div className="max-w-7xl text-center mx-auto sm:px-6 lg:px-8">
                    <div className="bg-white overflow-hidden shadow-xl sm:rounded-lg p-16">
                        <div className="flex gap-x-2 justify-center items-center mb-2" onClick={() => stg2()}>
                            <div className="text-2xl font-bold cursor-pointer">شروط وأسس التقديم للدراسة المسائية</div>
                            <MdOutlineNightlight className="h-10 w-10 items-center text-gray-400 -rotate-12" />
                        </div>
                        {stageState === 2 && (
                            <>
                                <div className="w-1/3 h-1 bg-gray-700 rounded-md mx-auto mb-7"></div>
                                <motion.ol variants={SlideDown} initial="hidden" animate="show" dir="rtl" className="text-right text-lg leading-10 list-decimal list-outside space-y-3">
                                    {stage2.map((item, index) => (
                                        <li className="text-justify" key={index}>{item}</li>
                                    ))}
                                </motion.ol>
                            </>
                        )}
                    </div>
                </div>
            </div>
        </Authenticated>
    );
}
