import Authenticated from "@/Layouts/Authenticated";
import { Head } from "@inertiajs/inertia-react";
import { useState } from "react";
import { motion } from "framer-motion";
import { SlideDown } from "@/animations";
import {FaChalkboardTeacher} from "react-icons/fa";

export default function Stages() {
    
    const stage1 = [
        [
            "يقوم الطالب بأنشاء الحساب الخاص به ضمن النظام باستخدام رقم الهاتف الفعال الخاص به واختيار كلمة مرور ليتمكن لاحقاً من الدخول الى نظام القبول المركزي للتعليم الأهلي.",
        ],
        [
            "يقوم الطالب بتفعيل خدمات التبليغات والحجز الإلكتروني والتواصل من خلال الرسائل القصيرة  sms ليتمكن الطالب من استخدام هذه الخدمات اثناء مرحلة التقديم ومطابقة البيانات والتسجيل.",
        ],
        [
            "يقوم الطالب بمليء البيانات الخاصة به من خلال البدء باختيار جهة التخرج ومن ثم اتباع إرشادات النظام خلال عملية ملئ البيانات وحسب متطلبات كل فئة من فئات الطلبة. ",
        ],
        [
            "يوفر النظام واجهة خاصة بالحجز الالكتروني لإدارة الحجوزات لمراجعة دائرة التعليم الجامعي الأهلي او مراكز التدقيق في الجامعات والكليات الاهلية وحسب متطلبات كل فئة من فئات الطلبة. ",
        ],
        [
            "تكون عملية مطابقة البيانات الكترونية للطلبة من خريجي وزارة التربية والذين يمتلكون الرقم الامتحاني وكلمة السر، ولا يحتاج الطالب مراجعة مراكز التدقيق في الجامعات والكليات الأهلية. ",
        ],
        [
            "لكافة فئات الطلبة الأخرى الذين لا يمتلكون ارقام امتحانية وارقام سرية او الذين لا يمتلكون ارقام سرية فقط تكون عملية مطابقة البيانات من خلال حجز موعد الكتروني لمراجعة مراكز التدقيق في الجامعات والكليات الاهلية. ",
        ],
        [
            "في حال وجود خلل في بيانات الطالب، يجب على الطالب حجز موعد الكتروني مع دائرة التعليم الجامعي الأهلي لإعادة التدقيق. ",
        ],
        [
            "في حال حاجة الطالب لمراجعة دائرة التعليم الأهلي، فيكون ذلك من خلال حجز موعد الكتروني مع اختيار سبب المراجعة.",
        ],
        [
            "بعد مطابقة البيانات، يتمكن الطالب من البدء بعملية التقديم من خلال ملئ الاستمارات الالكترونية بواقع (٤) خيارات ضمن القناة العامة للتقديم أضافة الى استمارتين للمشمولين بالتقديم ضمن القنوات الخاصة. ",
        ],
        [
            "يجب على الطلبة المشمولين الراغبين بالتقديم ضمن قناة الشهداء، ملئ استمارة التفعيل الخاصة بهذه القناة والموجودة ضمن نافذة القنوات الخاصة في النظام، ومن ثم يتم بعدها مراجعة مؤسسة الشهداء لمصادقة الاستمارة واتمام تفعيل القناة الكترونياً على الطالب متابعة حسابه يوميا للتأكد من حالة المصادقة التي تؤكد تقديمه على استمارة تفعيل قناة ذوى الشهداء.",
        ],
        [
            "يجب على الطلبة المشمولين الراغبين بتفعيل القنوات الخاصة الأخرى، طلب تفعيل القنوات من خلال نافذة القنوات الخاصة ضمن النظام وحجز موعد الكتروني مع مراكز التدقيق في الجامعات والكليات الاهلية مستصحبين معهم الوثائق الخاصة بالقناة لتفعيلها، ليتاح لهم البدء بالتقديم ضمن هذه القنوات.",
        ],
        [
            "بإمكان الطالب الغاء الاستمارات الخاصة به اثناء مرحلة التقديم انسحاب اثناء التقديم وذلك من خلال نافذة التقديم ضمن النظام وبواقع (٤) محاولات كحد أعلى. ",
        ],
        [
            "يقوم النظام بأجراء عملية المفاضلة بصورة ديناميكية وانية حيث تظهر قبولات الطلبة حسب خياراتهم في استمارات التقديم ويتم تحديث النتائج باستمرار طوال مرحلة التقديم والتسجيل. ",
        ],
        [
            "تبدأ مرحلة التسجيل بعد انتهاء مرحلة التقديم، حيث يقوم الطالب باستصحاب (كود التسجيل) والتوجه إلى أحد الأقسام التي تم قبوله فيها لإتمام عملية التسجيل. ",
        ],
        [
            "بعد إتمام الطالب عملية التسجيل في أحد الأقسام التي تم قبوله فيها، يتم الغاء خيارات القبول الخاصة به، لإتاحة الفرصة لبقية الطلبة وحسب نتائج عملية المفاضلة.",
        ]
    ];
    const [stageState, setStageState] = useState(1);
    // const stg1 = () => {
    //     if(stageState == 0 || stageState == 2){
    //         setStageState(1);
    //     }else{
    //         setStageState(0);
    //     }
    // };
    // const stg2 = () => {
    //     if(stageState == 0 || stageState == 1){
    //         setStageState(2);
    //     }else{
    //         setStageState(0);
    //     }
    // };
    return (
        <Authenticated >
            <Head title="شروط واسس التقديم" />

            <div className="py-12">
                <div className="max-w-7xl text-center mx-auto sm:px-6 lg:px-8">
                    <div className="bg-white overflow-hidden shadow-xl sm:rounded-lg p-16">
                        {/* at click on id stage1 change stageState  */}
                        <div className="flex gap-x-2 justify-center items-center mb-2">
                            <div id="stage1" className="text-2xl font-bold cursor-pointer">الارشادات العامة</div>
                            <FaChalkboardTeacher className="h-10 w-10 items-center text-yellow-400" />
                        </div>
                        <div className="w-1/3 h-1 bg-gray-700 rounded-md mx-auto mb-7"></div>
                        <motion.ol variants={SlideDown} initial="hidden" animate="show" dir="rtl" className="text-right text-lg leading-10 list-decimal list-outside space-y-3">
                            {stage1.map((item, index) => (
                                <li className="text-justify" key={index}>{item}</li>
                            ))}
                        </motion.ol>
                    </div>
                </div>
            </div>
        </Authenticated>
    );
}
